Autodesk.Revit.UI.DockablePane.Enable(System.Boolean)
Enable/Disable the pane
Since:
2014

Autodesk.Revit.UI.DockablePane.SetTitle(System.String)
Set the title (a.k.a. window caption) of the dockable pane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027